testsuite/sysbench/results/oltp_read_write.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 2077.55 qps: 41579.05 (r/w/o: 29108.99/8312.83/4157.23) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2134.85 qps: 42701.05 (r/w/o: 29889.94/8541.41/4269.71) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2119.15 qps: 42395.03 (r/w/o: 29675.04/8481.70/4238.30) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1790451
        write:                           511564
        other:                           255842
        total:                           2557857
    transactions:                        127953 (2131.83 per sec.)
    queries:                             2557857 (42616.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2131.8257
    time elapsed:                        60.0205s
    total number of events:              127953

Latency (ms):
         min:                                   10.66
         avg:                                   30.03
         max:                                   88.90
         95th percentile:                       42.61
         sum:                              3841797.93

Threads fairness:
    events (avg/stddev):           1999.2656/17.66
    execution time (avg/stddev):   60.0281/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 2228.02 qps: 44594.58 (r/w/o: 31218.42/8918.00/4458.16) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2251.60 qps: 45035.93 (r/w/o: 31525.47/9007.26/4503.20) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2263.95 qps: 45276.53 (r/w/o: 31693.57/9055.11/4527.85) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1888863
        write:                           539715
        other:                           269898
        total:                           2698476
    transactions:                        134981 (2248.80 per sec.)
    queries:                             2698476 (44956.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2248.8015
    time elapsed:                        60.0237s
    total number of events:              134981

Latency (ms):
         min:                                   10.79
         avg:                                   28.46
         max:                                   85.19
         95th percentile:                       40.37
         sum:                              3841431.70

Threads fairness:
    events (avg/stddev):           2108.9219/48.66
    execution time (avg/stddev):   60.0224/0.01